kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
#ifdef WIFI_LOGGER

#include "wifi_logger.h"

#include <Arduino.h>
#include <freertos/ringbuf.h>
#include <ESPmDNS.h>
#if WIFI_MANAGER
#include <WiFiManager.h>
#endif
#include <WebSocketsServer.h>
#include <WebServer.h>
#include <HTTPUpdate.h>

#include "msp.h"
#include "platform.h"
#include "targets.h"

#define QUEUE_SIZE 256

#ifndef WIFI_AP_SSID
#define WIFI_AP_SSID "ExpressLRS AP"
#endif
#ifndef WIFI_AP_PSK
#define WIFI_AP_PSK "expresslrs"
#endif

#ifndef WIFI_TIMEOUT
#define WIFI_TIMEOUT 60 // default to 1min
#endif

MDNSResponder mdns;
WebServer server(80);
WebSocketsServer webSocket = WebSocketsServer(81);
#define WEBSOCKET_BROADCASET(text) webSocket.broadcastTXT(text)
#define WEBSOCKET_SEND(sock, text) webSocket.sendTXT(sock, text)

/*************************************************************************/

static QueueHandle_t DRAM_ATTR receive_queue = NULL;
static QueueHandle_t DRAM_ATTR send_queue = NULL;

class CtrlSerialPrivate: public CtrlSerial
{
public:
  void set_queue_rx(QueueHandle_t q) {
    p_queue_rx = q;
  }
  void set_queue_tx(QueueHandle_t q) {
    p_queue_tx = q;
  }

  size_t available(void) {
    if (p_queue_rx == NULL)
      return 0;
    return uxQueueMessagesWaiting(p_queue_rx);
  }
  uint8_t read(void) {
    uint8_t out;
    if (p_queue_rx && xQueueReceive(p_queue_rx, &out, (TickType_t)1)) {
      return out;
    }
    return 0;
  }

  void write(uint8_t * buffer, size_t size) {
    if (p_queue_tx == NULL)
      return;
    while (size--)
      xQueueSend(p_queue_tx, (void *)buffer++, (TickType_t)0);
  }

private:
  QueueHandle_t p_queue_rx = NULL;
  QueueHandle_t p_queue_tx = NULL;
};

CtrlSerialPrivate ctrl_msp_send;
CtrlSerialPrivate ctrl_msp_receive;
CtrlSerial& ctrl_serial = ctrl_msp_send;

/*************************************************************************/

String inputString = "";
String my_ipaddress_info_str = "NA";

static const char PROGMEM GO_BACK[] = R"rawliteral(
<!DOCTYPE html>
<html>
    <head>
    </head>
    <body>
        <script>
            javascript:history.back();
        </script>
    </body>
</html>
)rawliteral";

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>

<head>
    <meta name="viewport" content="width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
    <title>TX Log Messages</title>
    <style>
        body {
            background-color: #1E1E1E;
            font-family: Arial, Helvetica, Sans-Serif;
            Color: #69cbf7;
        }

        textarea {
            background-color: #252525;
            Color: #C5C5C5;
            border-radius: 5px;
            border: none;
        }
    </style>
    <script>
        var websock;
        function start() {
            document.getElementById("logField").scrollTop = document.getElementById("logField").scrollHeight;
            websock = new WebSocket('ws://' + window.location.hostname + ':81/');
            websock.onopen = function (evt) {
              console.log('websock open');
            };
            websock.onclose = function(e) {
              console.log('Socket is closed. Reconnect will be attempted in 1 second.', e.reason);
              setTimeout(function() {
                start();
              }, 1000);
            };
            websock.onerror = function (evt) { console.log(evt); };
            websock.onmessage = function (evt) {
                //console.log(evt);
                var text = evt.data;
                if (text.startsWith("ELRS_setting_")) {
                  var res = text.replace("ELRS_setting_", "");
                  res = res.split("=");
                  setting_set(res[0], res[1]);
                } else {
                  var logger = document.getElementById("logField");
                  var autoscroll = document.getElementById("autoscroll").checked;
                  var date = new Date();
                  var n=new Date(date.getTime() - (date.getTimezoneOffset() * 60000)).toISOString();
                  logger.value += n + ' ' + text + '\n';
                  if (autoscroll)
                    logger.scrollTop = logger.scrollHeight;
                }
            };
        }

        function saveTextAsFile() {
            var textToWrite = document.getElementById('logField').value;
            var textFileAsBlob = new Blob([textToWrite], { type: 'text/plain' });

            var downloadLink = document.createElement("a");
            downloadLink.download = "tx_log.txt";
            downloadLink.innerHTML = "Download File";
            if (window.webkitURL != null) {
                // Chrome allows the link to be clicked without actually adding it to the DOM.
                downloadLink.href = window.webkitURL.createObjectURL(textFileAsBlob);
            } else {
                // Firefox requires the link to be added to the DOM before it can be clicked.
                downloadLink.href = window.URL.createObjectURL(textFileAsBlob);
                downloadLink.onclick = destroyClickedElement;
                downloadLink.style.display = "none";
                document.body.appendChild(downloadLink);
            }

            downloadLink.click();
        }

        function destroyClickedElement(event) {
            // remove the link from the DOM
            document.body.removeChild(event.target);
        }

        function setting_set(type, value) {
          var elem = document.getElementById(type);
          if (elem) {
            if (type == "region_domain") {
              var domain_info = "Regulatory domain UNKNOWN";
              if (value == "0")
                domain_info = "Regulatory domain 915MHz";
              else if (value == "1")
                domain_info = "Regulatory domain 868MHz";
              else if (value == "2")
                domain_info = "Regulatory domain 433MHz";
              else if (value == "3")
                domain_info = "Regulatory domain ISM 2400";
              elem.innerHTML = domain_info;

              // update rate options
              var rates = document.getElementById("rates_input");
              while (rates.length > 0) {
                rates.remove(rates.length-1);
              }
              var options = [];
              if (value == "3") {
                options = ['250Hz', '125Hz', '50Hz'];
              } else {
                options = ['200Hz', '100Hz', '50Hz'];
              }
              for (i = 0; i < options.length; i++) {
                var option = document.createElement("option");
                option.text = options[i];
                option.value = i;
                rates.add(option);
              }
            } else {
              value = value.split(",");
              if (1 < value.length) {
                var max_value = parseInt(value[1], 10);
                if (elem.options[0].value == "R")
                  max_value = max_value + 1; // include reset
                var i;
                // enable all
                for (i = 0; i < elem.length; i++) {
                  elem.options[i].disabled = false;
                }
                // disable unavailable values
                for (i = (elem.length-1); max_value < i; i--) {
                  //elem.remove(i);
                  elem.options[i].disabled = true;
                }
              }
              elem.selectedIndex = [...elem.options].findIndex (option => option.value === value[0]);
            }
          }
        }

