kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
void handleSettingTlm(const char * input, int num)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_tlm_input=";
    settings_out += settings_tlm;
  } else if (*input == '=') {
    input++;
    settings_out = "[L] Setting telemetry: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {2, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    WEBSOCKET_SEND(num, settings_out);
  else
    WEBSOCKET_BROADCASET(settings_out);
}

void handleSettingDomain(const char * input, int num)
{
  settings_out = "[ERROR] Domain set is not supported!";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_region_domain=";
#if 1
    settings_out += settings_region;
#else
#if defined(Regulatory_Domain_AU_915) || defined(Regulatory_Domain_FCC_915)
        settings_out += 0;
#elif defined(Regulatory_Domain_EU_868) || defined(Regulatory_Domain_EU_868_R9)
        settings_out += 1;
#elif defined(Regulatory_Domain_AU_433) || defined(Regulatory_Domain_EU_433)
        settings_out += 2;
#elif defined(Regulatory_Domain_ISM_2400) || defined(Regulatory_Domain_ISM_2400_800kHz)
        settings_out += 3;
#else
        settings_out += 0xff;
#endif
#endif
  }
  if (0 <= num)
    WEBSOCKET_SEND(num, settings_out);
  else
    WEBSOCKET_BROADCASET(settings_out);
}

void SettingsSendWS(int num)
{
  handleSettingDomain(NULL, num);
  handleSettingRate(NULL, num);
  handleSettingPower(NULL, num);
  handleSettingTlm(NULL, num);
}

void MspVtxWrite(void)
{
  // TODO, FIXME: VTX power & freq
  uint8_t power = 1;
  uint16_t freq = 5880; //(uint16_t)msg[0] * 8 + msg[1]; // band * 8 + channel
  uint8_t vtx_cmd[] = {
    (uint8_t)(freq >> 8), (uint8_t)freq,
    power,
    (power == 0), // pit mode
  };

  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  msp_handler.sendPacket(&msp_out, &ctrl_msp_receive);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);

    WEBSOCKET_SEND(num, my_ipaddress_info_str);
    // Send settings
    SettingsSendWS(num);
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //WEBSOCKET_BROADCASET(payload, length);

    temp = strstr((char*)payload, "S_rate");
    if (temp) {
      handleSettingRate(&temp[6], num);
      break;
    }
    temp = strstr((char*)payload, "S_power");
    if (temp) {
      handleSettingPower(&temp[7], num);
      break;
    }
    temp = strstr((char*)payload, "S_telemetry");
    if (temp) {
      handleSettingTlm(&temp[11], num);
    }

    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    //hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //WEBSOCKET_BROADCASET("Invalid WStype: " + type);
    break;
  }
}

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handleRoot()
{
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

void wifi_setup(void)
{
  IPAddress my_ip;
#if defined(WIFI_SSID) && defined(WIFI_PSK)
  uint32_t iter, jter, timeout;
#endif
  //wifi_station_set_hostname("elrs_tx");

#if WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID" ESP32 TX")) {
    // AP found, connected
    my_ip = WiFi.localIP();
  }
  else
#elif defined(WIFI_SSID) && defined(WIFI_PSK)
  Serial.begin(115200);
  Serial.print("Connecting to wifi ");

  timeout = WIFI_TIMEOUT * 2;
  timeout /= 10;

  for (iter = 0; (iter < timeout) && (WiFi.status() != WL_CONNECTED); iter++) {
    if (WiFi.status() != WL_CONNECTED) {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_STA);
      WiFi.begin(WIFI_SSID, WIFI_PSK);

      jter = 0;
      while (++jter <= 50) {
        vTaskDelay(100);
        if (WiFi.status() == WL_CONNECTED) {
          break;
        } else if ((jter % 10) == 0) {
          Serial.print(".");
        }
      }
    }
  }
  if (WiFi.status() == WL_CONNECTED) {
    my_ip = WiFi.localIP();
    Serial.println(" CONNECTED!");
  } else
#endif // WIFI_MANAGER
  {
    Serial.println(" FAILED! Starting AP...");
    // No WiFi found, start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID" ESP32 TX", WIFI_AP_PSK);
    my_ip = WiFi.softAPIP();
  }

  if (mdns.begin("elrs_tx"))
  {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }

  my_ipaddress_info_str = "[L] My IP address = ";
  my_ipaddress_info_str += my_ip.toString();

  Serial.print("Connect to http://elrs_tx.local or http://");
  Serial.println(my_ip);

  server.on("/", handleRoot);
  server.on("/return", sendReturn);

  /* handling uploading firmware file (OTA update) */
  server.on("/update", HTTP_POST, []() {
    server.sendHeader("Connection", "close");
    //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
    if (Update.hasError()) {
      //server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "OTA flash failed!");
    } else {
      server.send(200, "text/html", "<HEAD><meta http-equiv=\"refresh\" content=\"0;url=/\"></HEAD>");
    }
    ESP.restart();
  }, []() {
    HTTPUpload& upload = server.upload();
    if (upload.status == UPLOAD_FILE_START) {
      platform_radio_force_stop();
      Serial.printf("Update: %s\n", upload.filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
      /* flashing firmware to ESP*/
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_END) {
      if (Update.end(true)) { //true to set the size to the current progress
        Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      } else {
        Update.printError(Serial);
      }
    }
  });

