kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
  server.onNotFound(handleRoot);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
}

int serialEvent(QueueHandle_t queue)
{
  char inChar;
  // process inputs
  uint32_t numBytes = uxQueueMessagesWaiting(queue);
  while (numBytes--)
  {
    if (xQueueReceive(queue, &inChar, (TickType_t)10)) {
      if (msp_handler.processReceivedByte(inChar)) {
        WEBSOCKET_BROADCASET("[L] MSP received");
        // msp fully received
        mspPacket_t &msp_in = msp_handler.getPacket();
        if (msp_in.type == MSP_PACKET_V1_ELRS) {
          switch (msp_in.function) {
            case ELRS_INT_MSP_PARAMS: {
              WEBSOCKET_BROADCASET("[L] ELRS params resp");
              uint8_t * payload = (uint8_t*)msp_in.payload;
              settings_rate = payload[0];
              settings_tlm = payload[1];
              settings_power = payload[2];
              settings_power_max = payload[3];
              settings_region = payload[4];
              SettingsSendWS(-1); // send to all clients
              break;
            }
          };
        }
        msp_handler.markPacketFree();

      } else if (!msp_handler.mspOngoing()) {
        if (inChar == '\r') {
          continue;
        } else if (inChar == '\n') {
          return 0;
        }
        inputString += inChar;
      }
    } else {
      break; // no more input data
    }
  }
  return -1;
}

void wifi_loop(QueueHandle_t queue)
{
  if (0 <= serialEvent(queue))
  {
    WEBSOCKET_BROADCASET(inputString);
    inputString = "";
  }
  server.handleClient();
  webSocket.loop();
}

void httpsTask(void *pvParameters)
{
  QueueHandle_t queue = (QueueHandle_t)pvParameters;

  wifi_setup();
  for(;;) {
    wifi_loop(queue);
  }

  /* delete the input queue */
  receive_queue = NULL;
  vQueueDelete(queue);

  /* and output queue */
  queue = send_queue;
  send_queue = NULL;
  vQueueDelete(queue);

  /* remove task */
  vTaskDelete( NULL );
}

TaskHandle_t wifiTask = NULL;
void wifi_start(void)
{
  if (wifiTask != NULL)
    return;

  receive_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));
  send_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));

  ctrl_msp_send.set_queue_rx(send_queue);
  ctrl_msp_send.set_queue_tx(receive_queue);

  ctrl_msp_receive.set_queue_rx(receive_queue);
  ctrl_msp_receive.set_queue_tx(send_queue);

  uint8_t taskPriority = 10;
  xTaskCreatePinnedToCore(
    httpsTask,              //Function to implement the task
    "wifiTask",             //Name of the task
    4096,                   //Stack size in words
    receive_queue,          //Task input parameter
    taskPriority,           //Priority of the task
    &wifiTask, 0);
}

/*************************************************************************/

int DebugSerial::available(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueMessagesWaiting(receive_queue);
}

int DebugSerial::availableForWrite(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueSpacesAvailable(receive_queue);
}

int DebugSerial::peek(void)
{
  return 0;
}

int DebugSerial::read(void)
{
  uint8_t out;
  if (receive_queue && xQueueReceive(receive_queue, &out, (TickType_t)1)) {
    return out;
  }
  return 0;
}

void DebugSerial::flush(void)
{
  /* do nothing */
}

size_t DebugSerial::write(uint8_t data)
{
  return write(&data, 1);
}

size_t DebugSerial::write(const uint8_t *buffer, size_t size)
{
  size_t num = 0;
  if (receive_queue == NULL)
    return 0;
  while (size--) {
    xQueueSend(receive_queue, (void *)buffer++, (TickType_t)0);
    num++;
  }
  return num;
}

DebugSerial debug_serial;

#endif // WIFI_LOGGER
